[
  "Tomato plants don’t just sip water through their roots—they also release moisture back into the air, helping nearby leaves stay cool on hot days. A single mature plant can move nearly a quart of water daily. Support the stems with a simple stake and remove the lowest leaves to keep fruit off the soil. Regular pruning keeps energy flowing to the blooms that matter most.",
  
  "Lavender thrives on a strict routine of sunshine and dry feet. Its silver leaves reflect heat, allowing the plant to sit gracefully in scorching beds that many herbs can’t handle. Harvest the flower spikes just as the buds open to capture peak fragrance. A small sachet in a drawer keeps clothes smelling fresh for months.",
  
  "Basil is happiest when you treat it like salad: frequent light harvests produce the fullest plants. Pinch the top two sets of leaves each time you cook, and new shoots will appear a few days later. The trimmed stems root easily in water, giving you a free second crop. Place a few pots by the back door and enjoy an endless pesto supply all summer.",
  
  "Marigold roots exude compounds that confuse destructive nematodes in vegetable beds. Planting a row around tomatoes forms a living barrier many soil pests will avoid. Their petals are edible, adding a mild citrus taste and vibrant color to salads. Deadhead spent blooms regularly and the plants will flower until frost.",
  
  "Compost happens faster when greens and browns are balanced like a layered cake. Kitchen scraps provide nitrogen while dry leaves add carbon, and a weekly turn with a garden fork lets air speed up the process. Finished compost smells like fresh earth and feels crumbly in your hand. Mix it into beds to retain water and cut fertilizer costs in half.",
  
  "Sunflowers pivot almost a full 180 degrees from dawn to dusk. This daily motion stops once the flower is mature, locking the seed head to face east and warm quickly each morning. The early heat attracts more pollinators, boosting seed production. Leave the dried heads on the stalk over winter and birds will handle the clean‑up for you.",
  
  "Mint spreads through underground runners that can travel two feet in a single season. An easy solution is to sink a bottomless pot into the soil, allowing good drainage without the runaway roots. Cut stems just before flowering for the strongest flavor. Excess leaves freeze well—blend with a splash of water and store in ice‑cube trays.",
  
  "Ferns predate dinosaurs and reproduce with spores instead of seeds. Indoors they prefer indirect light, consistently moist soil, and a misting now and then to mimic forest humidity. Fronds that turn brown at the tips usually signal dry air rather than lack of water. Trim the dead parts and you’ll trigger fresh, bright green growth.",
  
  "Pea plants capture nitrogen from the atmosphere with help from Rhizobium bacteria living in nodules on their roots. After the final harvest, cut off the vines but leave roots in place—they’ll break down and feed the next crop. A simple trellis of twine stops pods from sitting on damp soil. Fresh peas taste sweetest the same day they’re picked.",
  
  "Worm castings are essentially odor‑free fertilizer delivered right where roots need it. A handful added to each planting hole jump‑starts seedlings with gentle nutrients that won’t burn. Worm tunnels also improve drainage in heavy clay. Encourage populations by topping beds with a thin layer of shredded leaves each fall.",

  "Rosemary’s needle‑like leaves hold essential oils that intensify after every dry spell. Allow the top inch of soil to dry out before watering and the fragrance will deepen noticeably. A gentle trim shapes the plant into a tidy hedge and supplies fresh sprigs for roasting vegetables. In colder zones, pot it up and overwinter on a sunny windowsill to keep the flavor going year‑round.",

  "Calendula is sometimes called the ‘pot marigold,’ yet it’s a different species entirely and famous for soothing skin. Petals add a soft saffron hue to soups and rice without altering flavor. Deadheading spent blooms encourages new buds, turning one seeding into months of color. Pollinators flock to the nectar while aphids tend to stay away.",

  "Chives are one of the first herbs to push through spring soil, offering a mild onion flavor right when salads need a boost. Snip leaves at the base rather than mid‑stem and they regrow in tidy clumps. Let a few plants flower—those purple pom‑poms are edible and bring in early bees. Divide crowded clumps every three years for endless starts to share.",

  "Zucchini plants seem unstoppable, yet consistent harvest actually keeps the fruit tender and the plant productive. Pick when the squash is roughly the length of your hand; anything bigger shifts energy toward seeds. Large leaves sometimes shade neighboring crops, so remove one or two outer leaves to improve airflow. Bees adore the big yellow blossoms and boost yields even more.",

  "Thyme hugs the ground, making it a fragrant living mulch that suppresses weeds between stepping stones. The woody stems tolerate light foot traffic and release a pleasant aroma when brushed. Harvest small handfuls just before flowering for peak flavor. Allowing a few flowers to open invites tiny wasps that prey on garden pests.",

  "Corn grows so quickly it can gain a foot of height in a warm week. Roots are shallow, so a steady supply of water at soil level keeps stalks sturdy and kernels full. Plant in short, square blocks rather than a single row—group pollination ensures every ear fills out evenly. After harvest, chopped stalks make excellent carbon for the compost pile.",

  "Lemon balm carries a citrus scent that calms nerves and can be brewed into a gentle bedtime tea. Like mint, it spreads fast, but responds well to regular trimming and container growing. Leaves are most aromatic in the morning after dew dries. A light mulch of compost each spring is all it needs to stay lush.",

  "Carrot seeds germinate slowly, giving weeds a head start. Row‑cover fabric traps warmth and moisture, speeding sprouting by several days. Thin seedlings to a thumb’s width apart so roots can expand without twisting. The feathery tops are edible too—blend into pesto for a mild parsley flavor.",

  "Hydrangea flower color is influenced by soil pH: acidic soils yield blue blooms, alkaline soils lean pink. You can nudge the hue by adding garden sulfur or lime months before flowering. Consistent moisture prevents leaf scorch, but avoid waterlogged ground. Prune just after flowering to avoid cutting off next season’s buds.",

  "Strawberries send out runners that quickly root to form new plants, perfect for filling a raised bed. Pinch off the first flush of blossoms on young plants; the energy saved translates into larger berries later in the season. Mulch with straw to keep fruit clean and deter slugs. After three productive years, replace mother plants with the strongest runners to keep harvests high."
] 