[
  "Basil does more than flavor pasta dishes.  When allowed to flower, it draws in hoverflies and lacewings—tiny insects that eat aphids before they can damage nearby vegetables.  Just trim every few weeks so the plant keeps producing both leaves and blooms.",
  "Coneflowers are drought‑tough, but they also store energy for birds.  Goldfinches wait until the seed heads dry, then perch right on top to feed.  Leave the stems standing through winter and you’ll give the birds a natural snack bar.",
  "Thyme can handle foot traffic, which makes it perfect for the cracks between stepping‑stones.  Light pressure releases a clean, herbal scent while the dense roots help keep weeds from sprouting in the same space.",
  "Calendula petals are edible and mildly peppery.  Toss a few into salads or dry them for a tea that herbalists say soothes sore throats.  The bright flowers also lure predatory wasps that keep caterpillars in check.",
  "Comfrey sends taproots two metres deep, mining minerals that shallow‑rooted crops can’t reach.  Chop the leaves a couple of times a season, let them wilt for a day, and drop them as a mulch that feeds the soil as it breaks down.",
  "Lavender shrubs tolerate poor, sandy soil as long as it drains fast.  Their grey leaves reflect sunlight, helping the plant keep water loss low in high heat.  A single row can act as a fragrant, low‑maintenance border for years.",
  "Parsley is a biennial: leaves the first year, flowers the second.  If you can spare a few plants to overwinter, the umbrella‑shaped blooms become an early‑season food source for hoverflies and tiny native bees.",
  "Yarrow foliage contains natural compounds that help cuts clot more quickly—soldiers once packed the leaves into field dressings.  In the garden, those same compounds make an excellent compost activator that speeds decomposition.",
  "Sunflowers turn east at dawn and track the sun until dusk, a process called heliotropism.  This daily movement warms the flower heads, making them more attractive to pollinating bees and boosting seed production.",
  "Milkweed produces extra floral nectar on its stems, so ants patrol the plant in exchange for the sweet reward.  Their presence discourages caterpillars that would otherwise chew the leaves—nature’s version of garden security.",
  "Chives push up before the last frost has even left the ground.  The first flush of hollow leaves captures early sunlight, and the purple pom‑pom flowers offer nectar to emerging pollinators when little else is in bloom.",
  "Turmeric isn’t just a spice; its roots store curcumin, a natural antioxidant that protects the plant from soil‑borne diseases.  Gardeners can harvest a few rhizomes each year without hurting the mother plant’s ability to resprout.",
  "Sorrel leaves carry a lemony tang thanks to oxalic acid.  The same compound acts as a mild natural preservative, slowing leaf breakdown when sorrel is used as a wrap for storing delicate cheeses or fish.",
  "Dill’s feathery foliage shades its own roots, lowering soil temperature by up to 4 °C on hot days.  Plant it beside young carrots to help prevent heat stress while attracting beneficial wasps that target carrot rust fly.",
  "Oregano can release volatile oils that inhibit certain fungal spores in the topsoil.  A small border around tomatoes reduces splash‑borne blight during heavy rain, and any trimmings can be dried for kitchen use.",
  "Bee balm (Monarda) contains thymol, the same compound found in commercial mouthwash.  Indigenous communities brewed the leaves as a respiratory tea; today, the bright red flowers remain a magnet for hummingbirds.",
  "Rhubarb’s huge leaves funnel rainwater to its crown, but remember: the leaves store oxalates that are toxic if eaten.  Harvest only the stalks, and compost the leaves to add bulk—heat will break the compounds down safely.",
  "Marigold roots exude chemicals that suppress certain soil nematodes.  A six‑week cover planting before tomatoes or peppers can cut nematode populations by half, reducing wilt and improving overall yield.",
  "Lemon verbena can drop all of its leaves when temperatures dip below 7 °C, yet the woody stems stay alive and re‑leaf once warmth returns.  Give it a sheltered spot, and you’ll enjoy the same plant for many seasons.",
  "Cilantro bolts quickly in midsummer, but the tiny white flowers are a powerhouse for hoverflies, which prey on aphids.  Let a few plants bloom, then harvest the mature coriander seeds for baking and spice blends."
]
